Autodesk.Revit.DB.SSEPointVisibilitySettings.SetVisibility(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Boolean)
Sets the SSE point visibility for the given category.
document:
The document.
categoryId:
The category id.
isVisible:
The visibility of the given category. True means the SSE points are visible.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The category is not valid for SSE.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.SSEPointVisibilitySettings.GetVisibility(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the SSE point visibility for the given category.
document:
The document.
categoryId:
The category id.
Returns:
The visibility of the given category. True means the SSE points are visible.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The category is not valid for SSE.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.SSEPointVisibilitySettings
Represents the settings contained in the document associated to the point display of Floor, Roof and Toposolid.
for serialization
public api methods
Since:
2024